AcDbGeomRef.evaluateAndCacheGeometry
If the AcDbGeomRef references some entities and also caches the constant
geometry, this method evaluates the current geometry from the referenced
entities and caches it in the constant geometry.

AcDbGeomRef.createEntity
Creates a new non-database resident AcDbEntity from the data the AcDbGeomRef
holds, and returns it to the caller. The caller is responsible for deleting
the entity after it is no more needed.

AcDbGeomRef.isEmpty
Checks if the AcDbGeomRef is empty, i.e. not referencing any entity,
subentity, and not holding any constant geometry.

AcDbGeomRef.isValid
Checks is the contents of this AcDbGeomRef is valid.

AcDbGeomRef.reset
Resets the contents of the AcDbGeomRef to empty.

AcDbGeomRef
Base class for the concrete derived classes like AcDbFaceRef, AcDbEdgeRef,
AcDbVertexRef, and AcDbPathRef. These are simple classes that keep a reference
to a subentity of an entity and can represent this subentity information in
various ways. They are used mainly to pass around information about geometry
of a subentity or of an entity, not to keep this information.
The subentity references are non-presistent. Anytime the referenced entity
is changed or re-evaluated, the subentity reference becomes invalid.
Persistent references can be established using AcDbAssocEdgeActionParam,
AcDbAssocPathActionParam, AcDbAssocVertexActionParam, or directly using
AcDbAssocGeomDependencies.